Public Attributes | List of all members
API_FontType Struct Reference
Font
Contains common information related to a font. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_Font_Head  | head
Specifies the name and index of the font. The flags field in the header specifies whether this is a vectorial font.
GSCharCode  | charCode
The character code used in the Unicode-ANSI string conversion routines of the GSRoot String Manager.
double  | ascent
The ascent of the characters (the height above the baseline).
double  | descent
The descent of the characters (the depth below the baseline).
double  | widMax
The maximum width of the characters in this font.
double  | externalLeading
The value of the external leading.
short  | substituteInd
Attribute ndex of the substitute font.
Detailed Description
Contains common information related to a font.
Member Data Documentation
◆ ascent
 API_FontType::ascent
The ascent of the characters (the height above the baseline).
◆ charCode
 API_FontType::charCode
The character code used in the Unicode-ANSI string conversion routines of the GSRoot String Manager.
◆ descent
 API_FontType::descent
The descent of the characters (the depth below the baseline).
◆ externalLeading
 API_FontType::externalLeading
The value of the external leading.
◆ head
 API_FontType::head
Specifies the name and index of the font. The flags field in the header specifies whether this is a vectorial font.
◆ substituteInd
 API_FontType::substituteInd
Attribute ndex of the substitute font.
◆ widMax
 API_FontType::widMax
The maximum width of the characters in this font.